[["WAZAINFO_000",""],["WAZAINFO_001","The target is physically pounded with a long tail, a"],["WAZAINFO_002","The target is attacked with a sharp chop. Critical hits"],["WAZAINFO_003","The target is slapped repeatedly, back and forth, two to"],["WAZAINFO_004","The target is hit with a flurry of punches that strike"],["WAZAINFO_005","The target is slugged by a punch thrown with"],["WAZAINFO_006","Numerous coins are hurled at the target to inflict"],["WAZAINFO_007","The target is punched with a fiery fist. This may also"],["WAZAINFO_008","The target is punched with an icy fist. This may also"],["WAZAINFO_009","The target is punched with an electrified fist."],["WAZAINFO_010","Hard, pointed, sharp claws rake the target to"],["WAZAINFO_011","The target is gripped and squeezed from both sides"],["WAZAINFO_012","A vicious, tearing attack with big pincers. The target"],["WAZAINFO_013","In this two-turn attack, blades of wind hit opposing"],["WAZAINFO_014","A frenetic dance to uplift the fighting spirit."],["WAZAINFO_015","The target is cut with a scythe or claw. It’s also one of"],["WAZAINFO_016","A gust of wind is whipped up by wings and launched"],["WAZAINFO_017","The target is struck with large, imposing wings"],["WAZAINFO_018","The target is blown away, and a different Pokémon is"],["WAZAINFO_019","The user flies up into the sky and then strikes its target"],["WAZAINFO_020","Things such as long bodies or tentacles are used to"],["WAZAINFO_021","The target is slammed with a long tail, vines, or the"],["WAZAINFO_022","The target is struck with slender, whiplike vines to"],["WAZAINFO_023","The target is stomped with a big foot. This may also"],["WAZAINFO_024","The target is quickly kicked twice in succession"],["WAZAINFO_025","The target is attacked by a kick launched with"],["WAZAINFO_026","The user jumps up high, then strikes with a kick. If the"],["WAZAINFO_027","The user lashes out with a quick, spinning kick. This"],["WAZAINFO_028","Sand is hurled in the target’s face, reducing the"],["WAZAINFO_029","The user sticks out its head and attacks by charging"],["WAZAINFO_030","The target is jabbed with a sharply pointed horn to"],["WAZAINFO_031","The target is jabbed repeatedly with a horn or beak"],["WAZAINFO_032","The user stabs the target with a horn that rotates"],["WAZAINFO_033","A physical attack in which the user charges and"],["WAZAINFO_034","The user drops onto the target with its full body"],["WAZAINFO_035","A long body, vines, or the like are used to wrap and"],["WAZAINFO_036","A reckless, full-body charge attack for slamming into"],["WAZAINFO_037","The user rampages and attacks for two to three"],["WAZAINFO_038","A reckless, life-risking tackle in which the user rushes"],["WAZAINFO_039","The user wags its tail cutely, making opposing"],["WAZAINFO_040","The user stabs the target with a poisonous stinger."],["WAZAINFO_041","The user damages the target twice in succession by"],["WAZAINFO_042","Sharp spikes are shot at the target in rapid"],["WAZAINFO_043","The user gives opposing Pokémon an intimidating"],["WAZAINFO_044","The target is bitten with viciously sharp fangs."],["WAZAINFO_045","The user growls in an endearing way, making"],["WAZAINFO_046","The target is scared off, and a different Pokémon is"],["WAZAINFO_047","A soothing lullaby is sung in a calming voice that"],["WAZAINFO_048","The user generates odd sound waves from its body"],["WAZAINFO_049","The target is hit with a destructive shock wave that"],["WAZAINFO_050","For four turns, this move prevents the target from"],["WAZAINFO_051","Opposing Pokémon are attacked with a spray of harsh"],["WAZAINFO_052","The target is attacked with small flames. This may"],["WAZAINFO_053","The target is scorched with an intense blast of fire."],["WAZAINFO_054","The user cloaks itself and its allies in a white mist"],["WAZAINFO_055","The target is blasted with a forceful shot of water."],["WAZAINFO_056","The target is blasted by a huge volume of water"],["WAZAINFO_057","The user attacks everything around it by swamping its"],["WAZAINFO_058","The target is struck with an icy-cold beam of energy."],["WAZAINFO_059","A howling blizzard is summoned to strike opposing"],["WAZAINFO_060","The target is attacked with a peculiar ray. This may"],["WAZAINFO_061","A spray of bubbles is forcefully ejected at the"],["WAZAINFO_062","The target is hit with a rainbow-colored beam."],["WAZAINFO_063","The target is attacked with a powerful beam."],["WAZAINFO_064","The target is jabbed with a sharply pointed beak"],["WAZAINFO_065","A corkscrewing attack that strikes the target with a"],["WAZAINFO_066","The user grabs the target and recklessly dives for"],["WAZAINFO_067","A powerful low kick that makes the target fall over."],["WAZAINFO_068","A retaliation move that counters any physical attack,"],["WAZAINFO_069","The target is thrown using the power of gravity."],["WAZAINFO_070","The target is slugged with a punch thrown at maximum"],["WAZAINFO_071","A nutrient-draining attack. The user’s HP is restored"],["WAZAINFO_072","A nutrient-draining attack. The user’s HP is restored"],["WAZAINFO_073","A seed is planted on the target. It steals some HP"],["WAZAINFO_074","The user’s body grows all at once, raising the"],["WAZAINFO_075","Sharp-edged leaves are launched to slash at opposing"],["WAZAINFO_076","In this two-turn attack, the user gathers light, then"],["WAZAINFO_077","The user scatters a cloud of poisonous dust that"],["WAZAINFO_078","The user scatters a cloud of numbing powder that"],["WAZAINFO_079","The user scatters a big cloud of sleep-inducing dust"],["WAZAINFO_080","The user attacks the target by scattering petals for"],["WAZAINFO_081","Opposing Pokémon are bound with silk blown from"],["WAZAINFO_082","This attack hits the target with a shock wave of pure"],["WAZAINFO_083","The target becomes trapped within a fierce vortex"],["WAZAINFO_084","A jolt of electricity crashes down on the target to"],["WAZAINFO_085","A strong electric blast crashes down on the target."],["WAZAINFO_086","The user launches a weak jolt of electricity that"],["WAZAINFO_087","A wicked thunderbolt is dropped on the target to"],["WAZAINFO_088","The user picks up and throws a small rock at the"],["WAZAINFO_089","The user sets off an earthquake that strikes every"],["WAZAINFO_090","The user opens up a fissure in the ground and drops"],["WAZAINFO_091","The user burrows into the ground, then attacks on the"],["WAZAINFO_092","A move that leaves the target badly poisoned."],["WAZAINFO_093","The target is hit by a weak telekinetic force."],["WAZAINFO_094","The target is hit by a strong telekinetic force."],["WAZAINFO_095","The user employs hypnotic suggestion to make the"],["WAZAINFO_096","The user meditates to awaken the power deep within its"],["WAZAINFO_097","The user relaxes and lightens its body to move"],["WAZAINFO_098","The user lunges at the target at a speed that makes"],["WAZAINFO_099","As long as this move is in use, the power of rage raises"],["WAZAINFO_100","The user switches places with another party Pokémon."],["WAZAINFO_101","The user makes the target see a frightening mirage."],["WAZAINFO_102","The user copies the target’s last move. The move"],["WAZAINFO_103","An earsplitting screech harshly lowers the target’s"],["WAZAINFO_104","By moving rapidly, the user makes illusory copies of"],["WAZAINFO_105","Restoring its own cells, the user restores its own HP"],["WAZAINFO_106","The user stiffens all the muscles in its body to raise"],["WAZAINFO_107","The user compresses its body to make itself look"],["WAZAINFO_108","The user releases an obscuring cloud of smoke or"],["WAZAINFO_109","The target is exposed to a sinister ray that"],["WAZAINFO_110","The user withdraws its body into its hard shell,"],["WAZAINFO_111","The user curls up to conceal weak spots and raise"],["WAZAINFO_112","The user throws up a sturdy wall that sharply raises its"],["WAZAINFO_113","A wondrous wall of light is put up to reduce damage"],["WAZAINFO_114","The user creates a haze that eliminates every stat"],["WAZAINFO_115","A wondrous wall of light is put up to reduce damage"],["WAZAINFO_116","The user takes a deep breath and focuses so that"],["WAZAINFO_117","The user endures attacks for two turns, then strikes"],["WAZAINFO_118","The user waggles a finger and stimulates its brain"],["WAZAINFO_119","The user counters the target by mimicking the target's"],["WAZAINFO_120","The user attacks everything around it by causing an"],["WAZAINFO_121","A large egg is hurled at the target with maximum force"],["WAZAINFO_122","The target is licked with a long tongue, causing"],["WAZAINFO_123","The target is attacked with a discharge of filthy"],["WAZAINFO_124","Unsanitary sludge is hurled at the target. This may"],["WAZAINFO_125","The user clubs the target with a bone. This may also"],["WAZAINFO_126","The target is attacked with an intense blast of"],["WAZAINFO_127","The user charges at the target and may make it flinch."],["WAZAINFO_128","The target is clamped and squeezed by the user's very"],["WAZAINFO_129","Star-shaped rays are shot at opposing Pokémon."],["WAZAINFO_130","The user tucks in its head to raise its Defense"],["WAZAINFO_131","Sharp spikes are shot at the target in rapid succession."],["WAZAINFO_132","The target is attacked with long, creeping tentacles,"],["WAZAINFO_133","The user temporarily empties its mind to forget its"],["WAZAINFO_134","The user distracts the target by bending a spoon."],["WAZAINFO_135","The user restores its own HP by up to half of its"],["WAZAINFO_136","The target is attacked with a knee kick from a jump."],["WAZAINFO_137","The user intimidates the target with the pattern on"],["WAZAINFO_138","The user eats the dreams of a sleeping target."],["WAZAINFO_139","A cloud of poison gas is sprayed in the face of"],["WAZAINFO_140","Round objects are hurled at the target to strike two to"],["WAZAINFO_141","The user drains the target’s blood. The user’s HP is"],["WAZAINFO_142","With a scary face, the user tries to force a kiss on"],["WAZAINFO_143","A second-turn attack move where critical hits land"],["WAZAINFO_144","The user transforms into a copy of the target right"],["WAZAINFO_145","A spray of countless bubbles is jetted at the opposing"],["WAZAINFO_146","The target is hit with rhythmically launched punches."],["WAZAINFO_147","The user scatters bursts of spores that"],["WAZAINFO_148","The user flashes a light that lowers the target’s"],["WAZAINFO_149","The target is attacked with an odd psychic wave. The"],["WAZAINFO_150","The user just flops and splashes around to no effect"],["WAZAINFO_151","The user alters its cellular structure to liquefy itself,"],["WAZAINFO_152","The target is hammered with a large pincer. Critical"],["WAZAINFO_153","The user attacks everything around it by causing a"],["WAZAINFO_154","The target is raked with sharp claws or scythes"],["WAZAINFO_155","The user throws the bone it holds. The bone loops"],["WAZAINFO_156","The user goes to sleep for two turns. This fully"],["WAZAINFO_157","Large boulders are hurled at opposing Pokémon to"],["WAZAINFO_158","The user bites hard on the target with its sharp front"],["WAZAINFO_159","The user makes its edges more jagged, which raises its"],["WAZAINFO_160","The user changes its type to become the same type"],["WAZAINFO_161","The user strikes with a simultaneous three-beam attack."],["WAZAINFO_162","The user chomps hard on the target with its sharp"],["WAZAINFO_163","The target is attacked with a slash of claws or"],["WAZAINFO_164","The user creates a substitute for itself using some of"],["WAZAINFO_165","This attack is used in desperation only if the user"],["WAZAINFO_166","It enables the user to permanently learn the move"],["WAZAINFO_167","A consecutive three-kick attack that becomes more"],["WAZAINFO_168","The user attacks and steals the target’s held item"],["WAZAINFO_169","The user ensnares the target with thin, gooey silk so it"],["WAZAINFO_170","The user senses the target’s movements with its"],["WAZAINFO_171","A sleeping target sees a nightmare that inflicts some"],["WAZAINFO_172","The user cloaks itself in fire and charges at the"],["WAZAINFO_173","This attack can be used only if the user is asleep."],["WAZAINFO_174","A move that works differently for the Ghost type"],["WAZAINFO_175","The user flails about aimlessly to attack. The less HP"],["WAZAINFO_176","The user changes its type to make itself resistant to"],["WAZAINFO_177","A vortex of air is shot at the target to inflict damage."],["WAZAINFO_178","The user releases cotton-like spores that cling to"],["WAZAINFO_179","An all-out attack that becomes more powerful the"],["WAZAINFO_180","The user unleashes its grudge on the move last used"],["WAZAINFO_181","The user attacks with a chilling gust of powdery snow."],["WAZAINFO_182","This move enables the user to protect itself from"],["WAZAINFO_183","The user throws a punch at blinding speed."],["WAZAINFO_184","The user frightens the target with a scary face to"],["WAZAINFO_185","The user approaches the target disarmingly, then throws"],["WAZAINFO_186","The user kisses the target with a sweet, angelic"],["WAZAINFO_187","The user maximizes its Attack stat in exchange for"],["WAZAINFO_188","Unsanitary sludge is hurled at the target. This may"],["WAZAINFO_189","The user hurls mud in the target’s face to inflict"],["WAZAINFO_190","The user attacks by spraying ink in the target’s face"],["WAZAINFO_191","The user lays a trap of spikes at the opposing"],["WAZAINFO_192","The user fires an electric blast like a cannon to inflict"],["WAZAINFO_193","Enables a Ghost-type target to be hit by Normal- and"],["WAZAINFO_194","After using this move, if the user faints, the"],["WAZAINFO_195","Any Pokémon that hears this song faints in three"],["WAZAINFO_196","The user attacks with a gust of chilled air. This also"],["WAZAINFO_197","This move enables the user to protect itself from"],["WAZAINFO_198","The user strikes the target with a hard bone two to"],["WAZAINFO_199","The user takes sure aim at the target. This ensures"],["WAZAINFO_200","The user rampages and attacks for two to three"],["WAZAINFO_201","A five-turn sandstorm is summoned to hurt all"],["WAZAINFO_202","A nutrient-draining attack. The user’s HP is restored"],["WAZAINFO_203","The user endures any attack with at least 1 HP."],["WAZAINFO_204","The user gazes at the target rather charmingly,"],["WAZAINFO_205","The user continually rolls into the target over five"],["WAZAINFO_206","A restrained attack that prevents the target from"],["WAZAINFO_207","The user enrages and confuses the target. However,"],["WAZAINFO_208","The user restores its own HP by up to half of its"],["WAZAINFO_209","The user throws an electrically charged tackle at the"],["WAZAINFO_210","The target is slashed with scythes or claws."],["WAZAINFO_211","The target is hit with wings of steel. This may also"],["WAZAINFO_212","The user pins the target with a dark, arresting look."],["WAZAINFO_213","If it is the opposite gender of the user, the target"],["WAZAINFO_214","While it is asleep, the user randomly uses one of the"],["WAZAINFO_215","The user makes a soothing bell chime to heal the"],["WAZAINFO_216","This full-power attack grows more powerful the more the"],["WAZAINFO_217","The user attacks by giving the target a gift with a"],["WAZAINFO_218","This full-power attack grows more powerful the less the"],["WAZAINFO_219","The user creates a protective field that prevents"],["WAZAINFO_220","The user adds its HP to the target’s HP, then equally"],["WAZAINFO_221","The target is razed with a mystical fire of great"],["WAZAINFO_222","The user attacks everything around it with a"],["WAZAINFO_223","The user punches the target with full, concentrated"],["WAZAINFO_224","Using its tough and impressive horn, the user rams"],["WAZAINFO_225","The user exhales a mighty gust that inflicts damage."],["WAZAINFO_226","The user switches places with a party Pokémon in"],["WAZAINFO_227","The user compels the target to keep using the move"],["WAZAINFO_228","The power of this attack move is doubled if it's used on"],["WAZAINFO_229","A spin attack that can also eliminate such moves as"],["WAZAINFO_230","A sweet scent that harshly lowers opposing Pokémon’s"],["WAZAINFO_231","The target is slammed with a steel-hard tail."],["WAZAINFO_232","The target is raked with steel claws. This may also"],["WAZAINFO_233","The user attacks last. In return, this throw move"],["WAZAINFO_234","The user restores its own HP. The amount of HP"],["WAZAINFO_235","The user restores its own HP. The amount of HP"],["WAZAINFO_236","The user restores its own HP. The amount of HP"],["WAZAINFO_237","A unique attack that varies in type depending on the"],["WAZAINFO_238","The user delivers a double chop with its forearms"],["WAZAINFO_239","The user whips up a vicious tornado to tear at opposing"],["WAZAINFO_240","The user summons a heavy rain that falls for five"],["WAZAINFO_241","The user intensifies the sun for five turns, powering"],["WAZAINFO_242","The user crunches up the target with sharp fangs."],["WAZAINFO_243","A retaliation move that counters any special attack,"],["WAZAINFO_244","The user hypnotizes itself into copying any stat"],["WAZAINFO_245","The user charges the target at blinding speed."],["WAZAINFO_246","The user attacks with a prehistoric power."],["WAZAINFO_247","The user hurls a shadowy blob at the target."],["WAZAINFO_248","Two turns after this move is used, a hunk of psychic"],["WAZAINFO_249","The user attacks with a punch that may lower the"],["WAZAINFO_250","The user traps the target in a violent swirling"],["WAZAINFO_251","The user gets all party Pokémon to attack the target."],["WAZAINFO_252","This attack hits first and makes the target flinch."],["WAZAINFO_253","The user attacks in an uproar for three turns."],["WAZAINFO_254","The user charges up power and raises both its"],["WAZAINFO_255","The power stored using the move Stockpile is"],["WAZAINFO_256","The power stored using the move Stockpile is"],["WAZAINFO_257","The user attacks by exhaling hot breath on opposing"],["WAZAINFO_258","The user summons a hailstorm lasting five turns."],["WAZAINFO_259","The user torments and enrages the target, making it"],["WAZAINFO_260","Flattery is used to confuse the target. However,"],["WAZAINFO_261","The user shoots a sinister flame at the target to inflict"],["WAZAINFO_262","The user faints when using this move. In return, this"],["WAZAINFO_263","This attack move doubles its power if the user is"],["WAZAINFO_264","The user focuses its mind before launching a punch."],["WAZAINFO_265","This attack's power is doubled when used on a target"],["WAZAINFO_266","The user draws attention to itself, making all targets"],["WAZAINFO_267","This attack makes use of nature’s power."],["WAZAINFO_268","The user boosts the power of the Electric move it"],["WAZAINFO_269","The target is taunted into a rage that allows it to use"],["WAZAINFO_270","The user assists an ally by boosting the power of"],["WAZAINFO_271","The user catches the target off guard and swaps its"],["WAZAINFO_272","The user mimics the target completely, copying the"],["WAZAINFO_273","One turn after this move is used, the user’s or its"],["WAZAINFO_274","The user hurriedly and randomly uses a move among those"],["WAZAINFO_275","The user lays roots that restore its HP on every turn."],["WAZAINFO_276","The user attacks the target with great power."],["WAZAINFO_277","Moves like Leech Seed and moves that inflict status"],["WAZAINFO_278","The user recycles a held item that has been used in"],["WAZAINFO_279","This attack move’s power is doubled if the user has"],["WAZAINFO_280","The user attacks with a swift chop. It can also break"],["WAZAINFO_281","The user lets loose a huge yawn that lulls the target"],["WAZAINFO_282","The user slaps down the target’s held item, and that"],["WAZAINFO_283","This attack move cuts down the target’s HP to equal"],["WAZAINFO_284","The user attacks opposing Pokémon with explosive"],["WAZAINFO_285","The user employs its psychic power to exchange"],["WAZAINFO_286","If opposing Pokémon know any move also known by"],["WAZAINFO_287","The user rests to cure itself of poisoning, a burn, or"],["WAZAINFO_288","If the user faints, the user’s grudge fully depletes"],["WAZAINFO_289","The user steals the effects of any attempts to use a"],["WAZAINFO_290","The additional effects of this attack depend upon where"],["WAZAINFO_291","Diving on the first turn, the user floats up and"],["WAZAINFO_292","The user lets loose a flurry of open-palmed arm"],["WAZAINFO_293","The user's type is changed depending on its environment,"],["WAZAINFO_294","The user stares at flashing lights to focus its mind,"],["WAZAINFO_295","The user lets loose a damaging burst of light."],["WAZAINFO_296","A mist-like flurry of down envelops and damages the"],["WAZAINFO_297","The user covers the target’s body with a mass of"],["WAZAINFO_298","The user performs a wobbly dance that confuses"],["WAZAINFO_299","The user launches a kick that lands a critical hit"],["WAZAINFO_300","The user kicks up mud on the battlefield. This weakens"],["WAZAINFO_301","The user attacks the target for five turns. The move's"],["WAZAINFO_302","The user attacks by wildly swinging its thorny arms."],["WAZAINFO_303","The user slacks off, restoring its own HP by up to"],["WAZAINFO_304","The user lets loose a horribly echoing shout with"],["WAZAINFO_305","The user bites the target with toxic fangs. This may"],["WAZAINFO_306","The user slashes the target with hard and sharp"],["WAZAINFO_307","The target is razed by a fiery explosion. The user"],["WAZAINFO_308","The target is hit with a watery blast. The user can’t"],["WAZAINFO_309","The target is hit with a hard punch fired like a"],["WAZAINFO_310","The user attacks the target while shouting in a"],["WAZAINFO_311","This attack move varies in power and type"],["WAZAINFO_312","The user releases a soothing scent that heals all"],["WAZAINFO_313","The user feigns crying to fluster the target, harshly"],["WAZAINFO_314","The user launches razor-like wind to slash opposing"],["WAZAINFO_315","The user attacks the target at full power. The attack’s"],["WAZAINFO_316","Enables a Ghost-type target to be hit by Normal- and"],["WAZAINFO_317","Boulders are hurled at the target. This also lowers"],["WAZAINFO_318","The target is attacked with powdery scales blown by the"],["WAZAINFO_319","A horrible sound like scraping metal harshly lowers"],["WAZAINFO_320","The user plays a pleasant melody that lulls the target"],["WAZAINFO_321","The user tickles the target into laughing, reducing its"],["WAZAINFO_322","The user absorbs a mystical power from space to"],["WAZAINFO_323","The user spouts water to damage opposing"],["WAZAINFO_324","The user attacks with a sinister beam of light. This may"],["WAZAINFO_325","The user throws a punch from the shadows."],["WAZAINFO_326","The user attacks with an odd, unseeable power."],["WAZAINFO_327","The user attacks the target with an uppercut thrown"],["WAZAINFO_328","The user traps the target inside a harshly raging"],["WAZAINFO_329","The target faints instantly. It’s less likely to hit the"],["WAZAINFO_330","The user attacks by shooting muddy water at opposing"],["WAZAINFO_331","The user forcefully shoots seeds at the target two"],["WAZAINFO_332","The user confounds the target with speed, then"],["WAZAINFO_333","The user launches sharp icicles at the target two to"],["WAZAINFO_334","The user hardens its body’s surface like iron,"],["WAZAINFO_335","The user blocks the target’s way with arms spread"],["WAZAINFO_336","The user howls loudly to raise the spirit of itself and"],["WAZAINFO_337","The user slashes the target with huge sharp claws."],["WAZAINFO_338","The user slams the target with the roots of an"],["WAZAINFO_339","The user tenses its muscles to bulk up its body,"],["WAZAINFO_340","The user bounces up high, then drops on the target"],["WAZAINFO_341","The user attacks by hurling a blob of mud at the"],["WAZAINFO_342","The user hits the target with its tail. This may also"],["WAZAINFO_343","The user endearingly approaches the target, then"],["WAZAINFO_344","The user electrifies itself and charges the target."],["WAZAINFO_345","The user scatters curious leaves that chase the"],["WAZAINFO_346","The user soaks the battlefield with water. This weakens"],["WAZAINFO_347","The user quietly focuses its mind and calms its"],["WAZAINFO_348","The user handles a sharp leaf like a sword and"],["WAZAINFO_349","The user vigorously performs a mystic, powerful"],["WAZAINFO_350","The user hurls hard rocks at the target. Two to five"],["WAZAINFO_351","The user strikes the target with a quick jolt of"],["WAZAINFO_352","The user attacks the target with a pulsing blast of"],["WAZAINFO_353","Two turns after this move is used, a concentrated"],["WAZAINFO_354","The user attacks the target at full power."],["WAZAINFO_355","The user lands and rests its body. This move restores"],["WAZAINFO_356","This move enables Flying-type Pokémon or Pokémon"],["WAZAINFO_357","Enables a Dark-type target to be hit by Psychic-type"],["WAZAINFO_358","This attack inflicts big damage on a sleeping target."],["WAZAINFO_359","The user swings and hits with its strong, heavy fist."],["WAZAINFO_360","The user tackles the target with a high-speed spin."],["WAZAINFO_361","The user faints. In return, the Pokémon taking its"],["WAZAINFO_362","If the target’s HP is half or less, this attack will hit"],["WAZAINFO_363","The user draws power to attack by using its held Berry."],["WAZAINFO_364","This attack hits a target using a move such as"],["WAZAINFO_365","The user pecks the target. If the target is holding a"],["WAZAINFO_366","The user whips up a turbulent whirlwind that ups"],["WAZAINFO_367","The user applies pressure to stress points, sharply"],["WAZAINFO_368","The user retaliates with much greater force against"],["WAZAINFO_369","After making its attack, the user rushes back to"],["WAZAINFO_370","The user fights the target up close without guarding"],["WAZAINFO_371","The user stores power, then attacks. If the user"],["WAZAINFO_372","If the target has already taken some damage in the"],["WAZAINFO_373","This move prevents the target from using its held item"],["WAZAINFO_374","The user flings its held item at the target to attack."],["WAZAINFO_375","Using its psychic power of suggestion, the user"],["WAZAINFO_376","The fewer PP this move has, the greater its power."],["WAZAINFO_377","For five turns, the user prevents the opposing team from"],["WAZAINFO_378","The user powerfully wrings the target. The more HP the"],["WAZAINFO_379","The user employs its psychic power to switch its"],["WAZAINFO_380","The user hurls up its stomach acids on the target."],["WAZAINFO_381","The user chants an incantation toward the sky,"],["WAZAINFO_382","The user cuts ahead of the target to copy and use the"],["WAZAINFO_383","The user mimics the move used immediately before"],["WAZAINFO_384","The user employs its psychic power to switch"],["WAZAINFO_385","The user employs its psychic power to switch"],["WAZAINFO_386","The more the target has powered up with stat changes,"],["WAZAINFO_387","This move can be used only after the user has used"],["WAZAINFO_388","A seed that causes worry is planted on the target."],["WAZAINFO_389","This move enables the user to attack first. This move"],["WAZAINFO_390","The user lays a trap of poison spikes at the feet of"],["WAZAINFO_391","The user employs its psychic power to switch stat"],["WAZAINFO_392","The user envelops itself in a veil made of water."],["WAZAINFO_393","The user levitates using electrically generated"],["WAZAINFO_394","The user cloaks itself in fire and charges the target."],["WAZAINFO_395","The target is attacked with a shock wave. This may"],["WAZAINFO_396","The user lets loose a blast of aura power from deep"],["WAZAINFO_397","The user polishes its body to reduce drag."],["WAZAINFO_398","The target is stabbed with a tentacle, arm, or the like"],["WAZAINFO_399","The user releases a horrible aura imbued with dark"],["WAZAINFO_400","The user slashes the target the instant an"],["WAZAINFO_401","The user attacks by swinging its tail as if it were a"],["WAZAINFO_402","The user slams a barrage of hard-shelled seeds"],["WAZAINFO_403","The user attacks with a blade of air that slices even"],["WAZAINFO_404","The user slashes at the target by crossing its"],["WAZAINFO_405","The user generates a damaging sound wave by"],["WAZAINFO_406","The target is attacked with a shock wave generated"],["WAZAINFO_407","The user tackles the target while exhibiting"],["WAZAINFO_408","The user attacks with a ray of light that sparkles as"],["WAZAINFO_409","An energy-draining punch. The user’s HP is restored"],["WAZAINFO_410","The user whirls its fists to send a wave of pure"],["WAZAINFO_411","The user heightens its mental focus and unleashes"],["WAZAINFO_412","The user draws power from nature and fires it at the"],["WAZAINFO_413","The user tucks in its wings and charges from a low"],["WAZAINFO_414","The user makes the ground under the target erupt"],["WAZAINFO_415","The user trades held items with the target faster"],["WAZAINFO_416","The user charges at the target using every bit of its"],["WAZAINFO_417","The user stimulates its brain by thinking bad"],["WAZAINFO_418","The user strikes the target with tough punches as"],["WAZAINFO_419","The power of this attack move is doubled if the user"],["WAZAINFO_420","The user flash-freezes chunks of ice and hurls them"],["WAZAINFO_421","The user slashes with a sharp claw made from"],["WAZAINFO_422","The user bites with electrified fangs. This may also"],["WAZAINFO_423","The user bites with cold-infused fangs. This may"],["WAZAINFO_424","The user bites with flame-cloaked fangs. This may"],["WAZAINFO_425","The user extends its shadow and attacks the target"],["WAZAINFO_426","The user launches a hard-packed mud ball to attack. This"],["WAZAINFO_427","The user tears at the target with blades formed by"],["WAZAINFO_428","The user focuses its willpower to its head and"],["WAZAINFO_429","The user lets loose a flash of energy at the target from"],["WAZAINFO_430","The user gathers all its light energy and releases it"],["WAZAINFO_431","A charging attack that may also leave the foe confused."],["WAZAINFO_432","A strong wind blows away the target’s barriers, such as"],["WAZAINFO_433","The user creates a bizarre area in which slower"],["WAZAINFO_434","Comets are summoned down from the sky onto the"],["WAZAINFO_435","The user strikes everything around it by letting loose"],["WAZAINFO_436","The user torches everything around it in an inferno"],["WAZAINFO_437","The user whips up a storm of leaves around the"],["WAZAINFO_438","The user violently whirls its vines, tentacles, or the"],["WAZAINFO_439","The user launches a huge boulder at the target to"],["WAZAINFO_440","A slashing attack with a poisonous blade that may"],["WAZAINFO_441","The user shoots filthy garbage at the target to"],["WAZAINFO_442","The user slams the target with its steel-hard head."],["WAZAINFO_443","The user launches steel bombs that stick to the target."],["WAZAINFO_444","The user stabs the target from below with"],["WAZAINFO_445","If any opposing Pokémon is the opposite gender of the"],["WAZAINFO_446","The user lays a trap of levitating stones around the"],["WAZAINFO_447","The user snares the target with grass and trips it."],["WAZAINFO_448","The user attacks the target with sound waves of"],["WAZAINFO_449","The user releases countless shots of light at the"],["WAZAINFO_450","The user bites the target. If the target is holding a"],["WAZAINFO_451","The user attacks the target with an electric charge."],["WAZAINFO_452","The user slams its rugged body into the target to"],["WAZAINFO_453","The user lunges at the target at a speed that makes"],["WAZAINFO_454","The user calls out its underlings to pummel the"],["WAZAINFO_455","The user calls out its underlings to shield its body,"],["WAZAINFO_456","The user calls out its underlings to heal it. The user"],["WAZAINFO_457","The user attacks the target with a hazardous,"],["WAZAINFO_458","The user slams the target with a long tail, vines, or a"],["WAZAINFO_459","The user blasts the target with power that distorts"],["WAZAINFO_460","The user tears the target along with the space"],["WAZAINFO_461","The user faints. In return, the Pokémon taking its"],["WAZAINFO_462","The target is crushed with great force. The more HP"],["WAZAINFO_463","The target becomes trapped within a maelstrom of"],["WAZAINFO_464","Opposing Pokémon are dragged into a world of total"],["WAZAINFO_465","The user emits a shock wave from its body to attack"],["WAZAINFO_466","The user blasts the target with a gust of repulsive"],["WAZAINFO_467","The user disappears, then strikes the target on the"],["WAZAINFO_468","The user sharpens its claws to boost its Attack stat"],["WAZAINFO_469","The user and its allies are protected from"],["WAZAINFO_470","The user employs its psychic power to average its"],["WAZAINFO_471","The user employs its psychic power to average its"],["WAZAINFO_472","The user creates a bizarre area in which Pokémon’s"],["WAZAINFO_473","The user materializes an odd psychic wave to attack"],["WAZAINFO_474","The user drenches the target in a special poisonous"],["WAZAINFO_475","The user sheds part of its body to make itself lighter"],["WAZAINFO_476","The user scatters a cloud of irritating powder to"],["WAZAINFO_477","The user makes the target float with its psychic power."],["WAZAINFO_478","The user creates a bizarre area in which Pokémon’s"],["WAZAINFO_479","The user throws a stone or similar projectile to"],["WAZAINFO_480","The user strikes the target with a fierce blow."],["WAZAINFO_481","The user attacks the target with a bursting flame. The"],["WAZAINFO_482","The user strikes everything around it by swamping"],["WAZAINFO_483","The user lightly performs a beautiful, mystic dance."],["WAZAINFO_484","The user slams into the target with its heavy body."],["WAZAINFO_485","Using an odd shock wave, the user inflicts damage on any"],["WAZAINFO_486","The user hurls an electric orb at the target."],["WAZAINFO_487","The user shoots a torrent of water at the target and"],["WAZAINFO_488","Cloaking itself in flame, the user attacks the target."],["WAZAINFO_489","The user coils up and concentrates. This raises its"],["WAZAINFO_490","The user makes a swift attack on the target’s legs,"],["WAZAINFO_491","The user spits fluid that works to melt the target."],["WAZAINFO_492","The user turns the target’s power against it."],["WAZAINFO_493","The user’s mysterious psychic wave changes the"],["WAZAINFO_494","The user dances with an odd rhythm that compels"],["WAZAINFO_495","The user helps the target and makes it use its move"],["WAZAINFO_496","The user attacks the target with a song. Others can"],["WAZAINFO_497","The user attacks the target with an echoing voice."],["WAZAINFO_498","Looking for an opening, the user strikes consistently."],["WAZAINFO_499","The user attacks the target by throwing a clump of"],["WAZAINFO_500","The user attacks the target with stored power."],["WAZAINFO_501","The user protects itself and its allies from"],["WAZAINFO_502","The user teleports using a strange power and"],["WAZAINFO_503","The user shoots boiling hot water at its target."],["WAZAINFO_504","The user breaks its shell, which lowers Defense and"],["WAZAINFO_505","The user emits a healing pulse that restores the"],["WAZAINFO_506","This relentless attack does massive damage to a"],["WAZAINFO_507","The user takes the target into the sky, then drops it"],["WAZAINFO_508","The user rotates its gears, raising its Attack stat and"],["WAZAINFO_509","The target is thrown, and a different Pokémon is"],["WAZAINFO_510","The user attacks opposing Pokémon with fire."],["WAZAINFO_511","The user suppresses the target and makes its move"],["WAZAINFO_512","The user nimbly strikes the target. If the user is not"],["WAZAINFO_513","The user reflects the target’s type, making the user the"],["WAZAINFO_514","The user gets revenge for a fainted ally. If an ally"],["WAZAINFO_515","The user risks everything to attack its target."],["WAZAINFO_516","The user passes its held item to the target when the"],["WAZAINFO_517","The user attacks by engulfing the target in an"],["WAZAINFO_518","A column of water hits the target. When used with its"],["WAZAINFO_519","A column of fire hits the target. When used with its"],["WAZAINFO_520","A column of grass hits the target. When used with its"],["WAZAINFO_521","After making its attack, the user rushes back to"],["WAZAINFO_522","While resisting, the user attacks opposing Pokémon."],["WAZAINFO_523","The user strikes everything around it by stomping"],["WAZAINFO_524","The user blows its cold breath on the target."],["WAZAINFO_525","The target is knocked away, and a different Pokémon"],["WAZAINFO_526","The user is roused, and its Attack and Sp. Atk"],["WAZAINFO_527","The user attacks and captures opposing Pokémon using an"],["WAZAINFO_528","The user shrouds itself in electricity and smashes"],["WAZAINFO_529","The user crashes into its target while rotating its"],["WAZAINFO_530","The user attacks its target by hitting it with brutal"],["WAZAINFO_531","The user unleashes a vicious blow after its cute act"],["WAZAINFO_532","The user drains the target's energy with its horns. The"],["WAZAINFO_533","The user attacks by slicing with a long horn. The"],["WAZAINFO_534","The user cuts its target with sharp shells. This may"],["WAZAINFO_535","The user slams its target with its flame-covered body."],["WAZAINFO_536","The user attacks its target by encircling it in sharp"],["WAZAINFO_537","The user crushes its target by rolling over the target"],["WAZAINFO_538","The user protects itself by wrapping its body in soft"],["WAZAINFO_539","The user lets loose a pitch-black shock wave at its"],["WAZAINFO_540","The user materializes an odd psychic wave to attack"],["WAZAINFO_541","The user attacks by striking the target with its hard"],["WAZAINFO_542","The user attacks by wrapping its opponent in a"],["WAZAINFO_543","The user charges its head into its target, using its"],["WAZAINFO_544","The user attacks by throwing steel gears at its target"],["WAZAINFO_545","The user torches everything around it in an inferno of"],["WAZAINFO_546","The user fires a beam of light at its target. The move's"],["WAZAINFO_547","The user sings an ancient song and attacks by appealing"],["WAZAINFO_548","The user cuts with its long horn. The odd power"],["WAZAINFO_549","The user attacks by blowing freezing cold air at"],["WAZAINFO_550","The user surrounds itself with a great amount of"],["WAZAINFO_551","The user attacks by engulfing the target in an intense,"],["WAZAINFO_552","Cloaked in flames, the user attacks the target by"],["WAZAINFO_553","On the second turn, the user hits the target with"],["WAZAINFO_554","On the second turn, an ultracold, freezing wind"],["WAZAINFO_555","The user yells as if it’s ranting about something,"],["WAZAINFO_556","The user attacks by harshly dropping large icicles"],["WAZAINFO_557","With a hot flame on its forehead, the user hurls itself"],["WAZAINFO_558","The user brings down a giant flame. This move's power is"],["WAZAINFO_559","The user throws down a giant lightning bolt. This move's"],["WAZAINFO_560","The user dives down onto the target from the sky. This"],["WAZAINFO_561","Using a pulled-up mat as a shield, the user protects"],["WAZAINFO_562","The user lets out a damaging belch at the target."],["WAZAINFO_563","Tilling the soil, the user makes it easier for plants to"],["WAZAINFO_564","The user weaves a sticky net around the opposing"],["WAZAINFO_565","When the user knocks out a target with this move,"],["WAZAINFO_566","The user vanishes somewhere, then strikes the"],["WAZAINFO_567","The user takes the target trick-or-treating. This adds"],["WAZAINFO_568","Letting out a noble roar, the user intimidates the"],["WAZAINFO_569","The user disperses electrically charged particles, which"],["WAZAINFO_570","The user attacks everything around it. The user's HP is"],["WAZAINFO_571","The user puts a forest curse on the target. The target"],["WAZAINFO_572","The user stirs up a violent petal blizzard and attacks"],["WAZAINFO_573","The user rapidly cools the target. This may also"],["WAZAINFO_574","Letting out a charming cry, the user does emotional"],["WAZAINFO_575","With a parting threat, the user lowers the target’s"],["WAZAINFO_576","All stat changes affecting the target turn topsy-turvy"],["WAZAINFO_577","The user steals the target’s HP with a kiss. The user’s"],["WAZAINFO_578","The user protects itself and its allies from status"],["WAZAINFO_579","The user raises the Defense stats of all Grass-type"],["WAZAINFO_580","The user turns the ground to grass for five turns."],["WAZAINFO_581","This protects Pokémon on the ground from status"],["WAZAINFO_582","If the target is electrified before it uses a move"],["WAZAINFO_583","The user plays rough with the target and attacks it."],["WAZAINFO_584","The user stirs up a fairy wind and strikes the target"],["WAZAINFO_585","Borrowing the power of the moon, the user attacks"],["WAZAINFO_586","The user attacks everything around it with the"],["WAZAINFO_587","By locking down the battlefield, the user keeps all"],["WAZAINFO_588","The user takes a defensive stance while it protects"],["WAZAINFO_589","The user and the target become friends, and the"],["WAZAINFO_590","The user tells the target a secret, and the target"],["WAZAINFO_591","The user whips up a storm of diamonds to damage opposing"],["WAZAINFO_592","The user immerses the target in superheated steam. This"],["WAZAINFO_593","Using a hyperspace hole, the user appears right next to"],["WAZAINFO_594","The user hits the target with throwing stars two to five"],["WAZAINFO_595","The user attacks by breathing a special, hot fire."],["WAZAINFO_596","In addition to protecting the user from attacks, this"],["WAZAINFO_597","The user raises the Sp. Def stat of an ally Pokémon"],["WAZAINFO_598","The user’s body generates an eerie impulse."],["WAZAINFO_599","Opposing Pokémon are drenched in an odd"],["WAZAINFO_600","The user covers the target in a combustible powder. If"],["WAZAINFO_601","The user absorbs energy and sharply raises its Sp. Atk,"],["WAZAINFO_602","The user manipulates magnetic fields, which raises"],["WAZAINFO_603","Using Happy Hour doubles the amount of prize money"],["WAZAINFO_604","The user electrifies the ground for five turns,"],["WAZAINFO_605","The user damages opposing Pokémon by emitting a"],["WAZAINFO_606","The Pokémon congratulates you on your special day!"],["WAZAINFO_607","The user and an ally hold hands. This makes them very"],["WAZAINFO_608","The user stares at the target with its baby-doll"],["WAZAINFO_609","The user attacks by nuzzling its electrified cheeks"],["WAZAINFO_610","The user holds back when it attacks, and the target is"],["WAZAINFO_611","The target is infested and attacked for four to five"],["WAZAINFO_612","Striking opponents over and over makes the user’s"],["WAZAINFO_613","The user absorbs its target's HP. The user's HP is"],["WAZAINFO_614","This move also hits opposing Pokémon that are in the"],["WAZAINFO_615","The user attacks with a wave that crawls along the"],["WAZAINFO_616","The user gathers the energy of the land and focuses that"],["WAZAINFO_617","Drawing power from the Eternal Flower, the user fires a"],["WAZAINFO_618","The user attacks opposing Pokémon with countless"],["WAZAINFO_619","The user attacks opposing Pokémon by manifesting"],["WAZAINFO_620","After soaring upward, the user attacks its target by"],["WAZAINFO_621","Using its many arms, the user unleashes a barrage of"],["WAZAINFO_622","The user builds up its momentum using its Z-Power and"],["WAZAINFO_623","The user builds up its momentum using its Z-Power and"],["WAZAINFO_624","The user rams an energy orb created by its Z-Power into"],["WAZAINFO_625","The user rams an energy orb created by its Z-Power into"],["WAZAINFO_626","The user soars up with its Z-Power and plummets toward"],["WAZAINFO_627","The user soars up with its Z-Power and plummets toward"],["WAZAINFO_628","The user creates a poisonous swamp using its Z-Power and"],["WAZAINFO_629","The user creates a poisonous swamp using its Z-Power and"],["WAZAINFO_630","The user burrows deep into the ground and slams into the"],["WAZAINFO_631","The user burrows deep into the ground and slams into the"],["WAZAINFO_632","The user summons a huge rock mountain using its Z-Power"],["WAZAINFO_633","The user summons a huge rock mountain using its Z-Power"],["WAZAINFO_634","The user binds the target with full force with threads"],["WAZAINFO_635","The user binds the target with full force with threads"],["WAZAINFO_636","Deep-seated grudges summoned by the user's Z-Power trap"],["WAZAINFO_637","Deep-seated grudges summoned by the user's Z-Power trap"],["WAZAINFO_638","The user spins very fast and rams into the target with"],["WAZAINFO_639","The user spins very fast and rams into the target with"],["WAZAINFO_640","The user breathes a stream of intense fire toward the"],["WAZAINFO_641","The user breathes a stream of intense fire toward the"],["WAZAINFO_642","The user creates a huge whirling current using its"],["WAZAINFO_643","The user creates a huge whirling current using its"],["WAZAINFO_644","The user collects energy from plants using its Z-Power"],["WAZAINFO_645","The user collects energy from plants using its Z-Power"],["WAZAINFO_646","The user hits the target with a powerful electric"],["WAZAINFO_647","The user hits the target with a powerful electric"],["WAZAINFO_648","The user controls the target with its Z-Power and hurts"],["WAZAINFO_649","The user controls the target with its Z-Power and hurts"],["WAZAINFO_650","The user dramatically drops the temperature using its"],["WAZAINFO_651","The user dramatically drops the temperature using its"],["WAZAINFO_652","The user materializes its aura using its Z-Power and"],["WAZAINFO_653","The user materializes its aura using its Z-Power and"],["WAZAINFO_654","The user gathers dark energy using its Z-Power and sucks"],["WAZAINFO_655","The user gathers dark energy using its Z-Power and sucks"],["WAZAINFO_656","The user creates a very charming space using its Z-Power"],["WAZAINFO_657","The user creates a very charming space using its Z-Power"],["WAZAINFO_658","The user, Pikachu, surrounds itself with the maximum"],["WAZAINFO_659","The user regains up to half of its max HP. It restores"],["WAZAINFO_660","Although this move has great power, it only works the"],["WAZAINFO_661","In addition to protecting the user from attacks, this"],["WAZAINFO_662","The user attacks while simultaneously stitching the"],["WAZAINFO_663","The user swings both arms and hits the target. The"],["WAZAINFO_664","The user bursts into song, emitting many bubbles. Any"],["WAZAINFO_665","The user swings and hits with its strong, heavy fist. It"],["WAZAINFO_666","The user restores the target's HP by up to half of its"],["WAZAINFO_667","The user fiercely attacks the target using its"],["WAZAINFO_668","The user restores its HP by the same amount as the"],["WAZAINFO_669","In this two-turn attack, the user gathers light and"],["WAZAINFO_670","The user attacks by pelting the target with leaves."],["WAZAINFO_671","The user shines a spotlight on the target so that only"],["WAZAINFO_672","The user shoots poisonous threads to poison the"],["WAZAINFO_673","The user concentrates intensely. The attack on the"],["WAZAINFO_674","The user engages its gears to raise the Attack and Sp."],["WAZAINFO_675","The user attacks the target’s throat, and the"],["WAZAINFO_676","The user attacks the enemy with a pollen puff that"],["WAZAINFO_677","The user entangles the target with its anchor chain"],["WAZAINFO_678","This protects Pokémon on the ground from priority moves"],["WAZAINFO_679","The user makes a lunge at the target, attacking with"],["WAZAINFO_680","The user strikes the target with a burning lash. This"],["WAZAINFO_681","The user boasts its strength and attacks the target. The"],["WAZAINFO_682","To inflict massive damage, the user burns itself out."],["WAZAINFO_683","The user exchanges Speed stats with the target."],["WAZAINFO_684","The user stabs the target with a sharp horn."],["WAZAINFO_685","The user heals the target's status condition. If the"],["WAZAINFO_686","The user attacks the target by dancing very hard. The"],["WAZAINFO_687","If the Pokémon the user has inflicted damage on have"],["WAZAINFO_688","The user lands an intense kick of tropical origins on"],["WAZAINFO_689","The user instructs the target to use the target's last"],["WAZAINFO_690","The user first heats up its beak, and then it attacks"],["WAZAINFO_691","The user rubs the scales on its entire body and makes a"],["WAZAINFO_692","The user uses its body like a hammer to attack the"],["WAZAINFO_693","The user swings its body around violently to inflict"],["WAZAINFO_694","This move reduces damage from physical and"],["WAZAINFO_695","The user, Decidueye, creates countless arrows using its"],["WAZAINFO_696","The user, Incineroar, strengthens its body using its"],["WAZAINFO_697","The user, Primarina, summons a massive amount of water"],["WAZAINFO_698","The user, the Land Spirit Pokémon, obtains Alola's"],["WAZAINFO_699","After obtaining Z-Power, the user, Marshadow, punches"],["WAZAINFO_700","After obtaining Z-Power, the user, Alolan Raichu,"],["WAZAINFO_701","Z-Power brings out the true capabilities of the user,"],["WAZAINFO_702","After obtaining Z-Power, the user, Eevee, gets energy"],["WAZAINFO_703","After obtaining Z-Power, the user, Mew, attacks the"],["WAZAINFO_704","The user sets a shell trap. If the user is hit by a"],["WAZAINFO_705","The user unleashes a strong beam. The attack's recoil"],["WAZAINFO_706","The user bites the target with its psychic capabilities."],["WAZAINFO_707","Driven by frustration, the user attacks the target."],["WAZAINFO_708","The user attacks by beating the target with a bone that"],["WAZAINFO_709","The user smashes into the target at high speed. This"],["WAZAINFO_710","The user slams into the target using a full-force"],["WAZAINFO_711","The user shoots powerful lasers using the power of a"],["WAZAINFO_712","The user hides in the target's shadow, steals the"],["WAZAINFO_713","The user slams into the target with the force of a"],["WAZAINFO_714","The user emits a sinister ray to attack the target. This"],["WAZAINFO_715","The user gets teary eyed to make the target lose"],["WAZAINFO_716","A strong electric blast crashes down on the target,"],["WAZAINFO_717","The user hits the target with the force of nature. It"],["WAZAINFO_718","Cloaking itself in high energy, the user slams into the"],["WAZAINFO_719","The user, Pikachu wearing a cap, powers up a jolt of"],["WAZAINFO_720","The user attacks everything around it by causing its own"],["WAZAINFO_721","The user attacks with electrically charged fists. This"],["WAZAINFO_722","The user attacks a target with a pillar of light. This"],["WAZAINFO_723","This attack inflicts Attack or Sp. Atk damage— whichever"],["WAZAINFO_724","After obtaining Z-Power, the user, Solgaleo, attacks the"],["WAZAINFO_725","After obtaining Z-Power, the user, Lunala, attacks the"],["WAZAINFO_726","After obtaining Z-Power, the user, Mimikyu, punches the"],["WAZAINFO_727","After obtaining Z-Power, the user, Lycanroc, attacks the"],["WAZAINFO_728","After obtaining Z-Power, the user, Kommo-o, attacks the"],["WAZAINFO_729","The user attacks the target with bursts of electricity"],["WAZAINFO_730","The user charges a huge wave with electricity and hits"],["WAZAINFO_731","The user floats in the air, and then dives at a steep"],["WAZAINFO_732","The more Pikachu loves its Trainer, the greater the"],["WAZAINFO_733","The user attacks by shooting water bubbles at the"],["WAZAINFO_734","The user shoots a jolt of electricity to attack the"],["WAZAINFO_735","The user cloaks itself in fire and charges at the"],["WAZAINFO_736","The user bombards the target with telekinetic force. A"],["WAZAINFO_737","The user acts bad and attacks the target. A wondrous"],["WAZAINFO_738","The user grows a gigantic stalk that scatters seeds to"],["WAZAINFO_739","The user attacks with a crystal made of cold frozen"],["WAZAINFO_740","The user attacks the target by wrapping it with a"],["WAZAINFO_741","The more Eevee loves its Trainer, the greater the move’s"],["WAZAINFO_742","The user rotates, centering the hex nut in its chest,"],["WAZAINFO_743","This move enables the user to protect itself from all"],["WAZAINFO_744","The user unleashes a strong beam from its core. This"],["WAZAINFO_745","The user ignores the effects of opposing Pokémon's moves"],["WAZAINFO_746","This move prevents the user and the target from"],["WAZAINFO_747","The user eats its held Berry, then sharply raises its"],["WAZAINFO_748","This move raises all the user's stats but prevents the"],["WAZAINFO_749","The user pours sticky tar over the target, lowering the"],["WAZAINFO_750","The user scatters a cloud of magic powder that changes"],["WAZAINFO_751","The user attacks twice using Dreepy. If there are two"],["WAZAINFO_752","The user has teatime with all the Pokémon in the battle."],["WAZAINFO_753","The user locks the target in and prevents it from"],["WAZAINFO_754","The user stabs the target with its electrified beak. If"],["WAZAINFO_755","The user rends the target with its hard gills. If the"],["WAZAINFO_756","With its mysterious power, the user swaps the effects on"],["WAZAINFO_757","This is a Fire-type attack Dynamax Pokémon use. The user"],["WAZAINFO_758","This is a Bug-type attack Dynamax Pokémon use. This"],["WAZAINFO_759","This is an Electric-type attack Dynamax Pokémon use. The"],["WAZAINFO_760","This is a Normal-type attack Dynamax Pokémon use. This"],["WAZAINFO_761","This is a Fighting-type attack Dynamax Pokémon use. This"],["WAZAINFO_762","This is a Ghost-type attack Dynamax Pokémon use. This"],["WAZAINFO_763","This is an Ice-type attack Dynamax Pokémon use. The user"],["WAZAINFO_764","This is a Poison-type attack Dynamax Pokémon use. This"],["WAZAINFO_765","This is a Water-type attack Dynamax Pokémon use. The"],["WAZAINFO_766","This is a Flying-type attack Dynamax Pokémon use. This"],["WAZAINFO_767","This is a Fairy-type attack Dynamax Pokémon use. The"],["WAZAINFO_768","This is a Dragon-type attack Dynamax Pokémon use. This"],["WAZAINFO_769","This is a Psychic-type attack Dynamax Pokémon use. The"],["WAZAINFO_770","This is a Rock-type attack Dynamax Pokémon use. The user"],["WAZAINFO_771","This is a Ground-type attack Dynamax Pokémon use. This"],["WAZAINFO_772","This is a Dark-type attack Dynamax Pokémon use. This"],["WAZAINFO_773","This is a Grass-type attack Dynamax Pokémon use. The"],["WAZAINFO_774","This is a Steel-type attack Dynamax Pokémon use. This"],["WAZAINFO_775","The user raises all its stats by using some of its HP."],["WAZAINFO_776","The user attacks by slamming its body into the target."],["WAZAINFO_777","The user sharply raises the target's Attack and Sp. Atk"],["WAZAINFO_778","The user plays its drum, controlling the drum's roots to"],["WAZAINFO_779","The user snares the target in a snap trap for four to"],["WAZAINFO_780","The user attacks by igniting a small stone and launching"],["WAZAINFO_781","The user becomes a gigantic sword and cuts the target."],["WAZAINFO_782","The user becomes a gigantic shield and slams into the"],["WAZAINFO_783","Morpeko attacks and raises its Speed with the energy"],["WAZAINFO_784","The user swings its tough tail wildly and attacks"],["WAZAINFO_785","The user attacks the target by poking it with a sharply"],["WAZAINFO_786","The user attacks opposing Pokémon by twanging a guitar"],["WAZAINFO_787","The user attacks the target with an acidic liquid"],["WAZAINFO_788","The user inflicts damage by dropping an apple from high"],["WAZAINFO_789","The user attacks the target with so much force that it"],["WAZAINFO_790","The user attacks the target by emitting steam. This may"],["WAZAINFO_791","The user scatters mysterious water around and restores"],["WAZAINFO_792","This move enables the user to protect itself from all"],["WAZAINFO_793","The user pretends to bow its head, but then it stabs the"],["WAZAINFO_794","The user attacks wildly with its thick leek. The user"],["WAZAINFO_795","This is Eternatus's most powerful attack in its original"],["WAZAINFO_796","The user fires a beam of steel that it collected from"],["WAZAINFO_797","The user attacks the target with its psychic power. This"],["WAZAINFO_798","The user attacks while destroying the terrain. This move"],["WAZAINFO_799","The user attacks by shooting scales two to five times in"],["WAZAINFO_800","In this two-turn attack, the user gathers space power"],["WAZAINFO_801","This move inflicts physical or special damage, whichever"],["WAZAINFO_802","The user attacks everything around it and faints upon"],["WAZAINFO_803","Gliding on the ground, the user attacks the target. This"],["WAZAINFO_804","The user attacks with electric voltage rising from the"],["WAZAINFO_805","The user utilizes the power of the terrain to attack."],["WAZAINFO_806","The user skitters behind the target to attack. This also"],["WAZAINFO_807","The user attacks with energy from jealousy. This leaves"],["WAZAINFO_808","The user lashes out to vent its frustration toward the"],["WAZAINFO_809","The user attacks the target by controlling the target's"],["WAZAINFO_810","The user surrounds everything around it with highly"],["WAZAINFO_811","The user properly coaches its ally Pokémon, boosting"],["WAZAINFO_812","After making its attack, the user rushes back to switch"],["WAZAINFO_813","A consecutive three-kick attack that becomes more"],["WAZAINFO_814","The user slams the target with its wings. The target is"],["WAZAINFO_815","The user throws scorching sand at the target to attack."],["WAZAINFO_816","The user becomes one with the jungle, restoring HP and"],["WAZAINFO_817","The user, having mastered the Dark style, strikes the"],["WAZAINFO_818","The user, having mastered the Water style, strikes the"],["WAZAINFO_819","The user traps the target in a cage of sparking"],["WAZAINFO_820","Converting its life-force into power, the user attacks"],["WAZAINFO_821","The user shoots its psychic power from its eyes to"],["WAZAINFO_822","The user transforms its wrath into a fire-like aura to"],["WAZAINFO_823","The user overwhelms the target with lightning-like"],["WAZAINFO_824","The user attacks by hurling a blizzard-cloaked icicle"],["WAZAINFO_825","The user attacks by sending a frightful amount of small"],["WAZAINFO_826","The user attacks with its tremendous psychic power. This"]]